// Это комментарий
// Объявление переменной
let i

// Присвоение переменной значение
i = 1

// Использование переменной
console.log(i) // 1

// Присвоение переменной нового значение
i = 42
console.log(i) // 42

// Объявление и присвоение переменной значение
let j = 24

// Объявление нескольких переменных
let a, b, c
a = 1
b = 2
c = 3

// Объявление и присвоение нескольких переменных
let a1 = 1,
    b1 = 2,
    c1 = 3

// Ошибка, переменная уже объявлена
//let a1

// Ошибка, переменная не может начинаться с цифры
//let 1a = 1

// Объявление не изменяемой переменной (константы)
const pi = 3.14

// Ошибка, нельзя изменять константу
//pi = 42
