// Создать PageObject для страницы https://testspace.orange.local.learn.ispringdev.com/s?s=account%2Fteam
// API свойств(ссыка увеличить команду, кнопка Пригласить участников, значение Авторов, Комментаторов, Участников, Поиск, Список участников)
// Методы (перейти по ссылке увеличение команды, поиск, добавить пользователей
// Для добавления создать отдельный PageObject, AddUserPopup
// На основе полученных PageObject написать начально наполнение пользователей
// Написать тесты на добавление, удаление, изменение роли пользователя
// Написать тесты для разных ролей пользователя
